{"class_name": "Sequential", "backend": "theano", "keras_version": "2.0.3", "config": [{"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "kernel_constraint": null, "name": "conv2d_1", "dilation_rate": [1, 1], "use_bias": true, "padding": "valid", "kernel_size": [3, 3], "activity_regularizer": null, "filters": 80, "activation": "linear", "data_format": "channels_first", "dtype": "float32", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 1, 80, 100], "trainable": true}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.30000001192092896, "name": "leaky_re_lu_1"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "strides": [3, 3], "name": "max_pooling2d_1", "data_format": "channels_first", "pool_size": [3, 3], "trainable": true}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "kernel_constraint": null, "name": "conv2d_2", "dilation_rate": [1, 1], "use_bias": true, "padding": "valid", "kernel_size": [3, 3], "activity_regularizer": null, "filters": 160, "activation": "linear", "data_format": "channels_first", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.30000001192092896, "name": "leaky_re_lu_2"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "strides": [3, 3], "name": "max_pooling2d_2", "data_format": "channels_first", "pool_size": [3, 3], "trainable": true}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "kernel_constraint": null, "name": "conv2d_3", "dilation_rate": [1, 1], "use_bias": true, "padding": "valid", "kernel_size": [3, 3], "activity_regularizer": null, "filters": 240, "activation": "linear", "data_format": "channels_first", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.30000001192092896, "name": "leaky_re_lu_3"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "strides": [3, 3], "name": "max_pooling2d_3", "data_format": "channels_first", "pool_size": [3, 3], "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.5, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "kernel_constraint": null, "name": "dense_1", "use_bias": true, "activity_regularizer": null, "activation": "linear", "units": 50, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "softmax", "name": "activation_1"}}]}